测试/jmeter/zhuce.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="4.0" jmeter="4.0 r1823414">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="测试计划" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="注册" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP消息头管理" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">PostmanRuntime/7.26.8</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJUb2tlbk1vZGVsIjoie1wiSURcIjpcImZkYjljZDAxLTY0YzMtNGExYi04NzUxLWRhYzAyYmIwYjE1M1wiLFwiTW9iaWxlTnVtYmVyXCI6XCIxODkwMTk3MjYwM1wiLFwiUm9sZVwiOlwiQ2xpZW50XCIsXCJUb2tlblR5cGVcIjoxfSIsImV4cCI6MTYxNzk3MDYyMSwiaXNzIjoiUHJldmVudEZyYXVkQVBJIiwiYXVkIjoiUHJldmVudEZyYXVkQVBQIn0.i2rUOlcMMK3v4fRjK-ZxypXVXx-uYCItGCgWo8DQNfc</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json;charset=utf-8</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP请求" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">fzapp-test.chanct.cn</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/hicore/api/Account/regist</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">\root\TestScript\注册.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.group</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">body</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname=" BeanShell预处理程序" enabled="false">
          <stringProp name="parameters">phoneNum,password</stringProp>
          <boolProp name="resetInterpreter">true</boolProp>
          <stringProp name="script">import com.example.paramlib.ParamUtil; //调用加密的jar包
String data1 =vars.get(&quot;Data&quot;);//获取加密前参数
String data=ParamUtil.buildParam(data1); //调用加密算法，加密data1，得到加密串data值
vars.put(&quot;data&quot;,data); //输出加密data值





/*import ParamUtil; //调用加密的jar包
String publish=vars.get(&quot;feePublishData&quot;)；
String publishData=ParamUtil.buildParam(publish)；
vars.put(&quot;publishData&quot;,publishData);

String seach =vars.get(&quot;feePublishData&quot;);//因为请求都需要加密，所以添加了一个用户参数把参数直接写里面，直接调用vars.get()来获取到
String seachData=ParamUtil.buildParam(seach);
vars.put(&quot;seachData&quot;,seachData);

String sms=vars.get(&quot;smsData&quot;);
String smsResponse=ParamUtil.buildParam(sms);//调用加密方法把取到的内容加密
vars.put(&quot;smsResponse&quot;,smsResponse);//调用vars.put（）把加密后的内容放入jmeter全局变量内



String lotter=var.get(&quot;lotterData&quot;);
String lotterResponse=ParamUtil.buildParam(lotter);
vars.put(&quot;lotterResponse&quot;,lotterResponse);
*/





</stringProp>
        </BeanShellPreProcessor>
        <hashTree/>
        <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell 后置处理程序" enabled="false">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">import com.example.paramlib.ParamUtil;//调用解密的jar包
import org.json.JSONObject;//调用json的jar包

String response = prev.getResponseDataAsString();//得到返回数据存在response
String Pcontent=ParamUtil.analyzeParam(response); //解密返回数据response，保存在Pcontent
vars.put(&quot;Pcontent&quot;,Pcontent);//输出解密返回的数据

</stringProp>
        </BeanShellPostProcessor>
        <hashTree/>
        <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="用户参数" enabled="false">
          <collectionProp name="UserParameters.names">
            <stringProp name="2122698">Data</stringProp>
          </collectionProp>
          <collectionProp name="UserParameters.thread_values">
            <collectionProp name="-1860548585">
              <stringProp name="-764331979">{   &quot;phoneNum&quot;: ${phoneNum},   &quot;password&quot;: ${password}, &quot;appVersion&quot;: &quot;string&quot;,   &quot;os&quot;: 0,   &quot;osVersion&quot;: &quot;string&quot;,   &quot;imei&quot;: &quot;string&quot;,   &quot;requestIP&quot;: &quot;string&quot;,   &quot;region&quot;: &quot;string&quot;,   &quot;smsVerifyCode&quot;: &quot;string&quot;,   &quot;pCode&quot;: 0,   &quot;registeWay&quot;: 0,   &quot;policeUserID&quot;: 0 }</stringProp>
            </collectionProp>
          </collectionProp>
          <boolProp name="UserParameters.per_iteration">false</boolProp>
        </UserParameters>
        <hashTree/>
        <com.github.johrstrom.listener.PrometheusListener guiclass="com.github.johrstrom.listener.gui.PrometheusListenerGui" testclass="com.github.johrstrom.listener.PrometheusListener" testname="Prometheus Listener" enabled="true">
          <collectionProp name="prometheus.collector_definitions">
            <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
              <stringProp name="collector.help">default help string</stringProp>
              <stringProp name="collector.metric_name">jsr223_rt_as_summary</stringProp>
              <stringProp name="collector.type">COUNTER</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
                <stringProp name="3059181">code</stringProp>
              </collectionProp>
              <stringProp name="collector.quantiles_or_buckets">0.75,0.5|0.95,0.1|0.99,0.01</stringProp>
              <stringProp name="listener.collector.listen_to">samples</stringProp>
              <stringProp name="listener.collector.measuring">ConnectTime</stringProp>
            </elementProp>
          </collectionProp>
        </com.github.johrstrom.listener.PrometheusListener>
        <hashTree/>
        <com.github.johrstrom.config.PrometheusMetricsConfig guiclass="com.github.johrstrom.config.gui.PrometheusMetricsConfigGui" testclass="com.github.johrstrom.config.PrometheusMetricsConfig" testname="Prometheus Metrics" enabled="true">
          <collectionProp name="prometheus.collector_definitions">
            <elementProp name="" elementType="com.github.johrstrom.collector.BaseCollectorConfig">
              <stringProp name="collector.help">default help string</stringProp>
              <stringProp name="collector.metric_name">jsr223_rt_as_summary</stringProp>
              <stringProp name="collector.type">COUNTER</stringProp>
              <collectionProp name="collector.labels">
                <stringProp name="102727412">label</stringProp>
                <stringProp name="3059181">code</stringProp>
              </collectionProp>
              <stringProp name="collector.quantiles_or_buckets">0.75,0.5|0.95,0.1|0.99,0.01</stringProp>
            </elementProp>
          </collectionProp>
        </com.github.johrstrom.config.PrometheusMetricsConfig>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>